## 테라폼 구축 계획
 #### terraform init ⚙️`success`
 #### terraform fmt 🖌`success`
 #### terraform validate 🤖`success`
 <details><summary>문법 검사 결과</summary>

 ```

 Success! The configuration is valid.


 ```

 </details>

 #### terraform plan 📖`success`

 <details><summary>테라폼 구축 계획</summary>

 ```

 terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.route53.data.aws_route53_zone.selected: Reading...[0m[0m
[0m[1mmodule.web.data.aws_ami.ubuntu: Reading...[0m[0m
[0m[1mmodule.public_lb.data.aws_acm_certificate.amazon_issued: Reading...[0m[0m
[0m[1mmodule.route53.data.aws_lb_hosted_zone_id.main: Reading...[0m[0m
[0m[1mmodule.db.data.aws_secretsmanager_secret.by-name: Reading...[0m[0m
[0m[1mmodule.route53.data.aws_lb_hosted_zone_id.main: Read complete after 0s [id=ZWKZPGTI48KDX][0m
[0m[1mmodule.was.data.aws_ami.ubuntu: Reading...[0m[0m
[0m[1mmodule.route53.data.aws_route53_zone.selected: Read complete after 1s [id=Z05489631OD6CTLXAVCWK][0m
[0m[1mmodule.db.data.aws_secretsmanager_secret.by-name: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:458197257493:secret:db-secret-6sXuZX][0m
[0m[1mmodule.db.data.aws_secretsmanager_secret_version.db-secret: Reading...[0m[0m
[0m[1mmodule.web.data.aws_ami.ubuntu: Read complete after 1s [id=ami-037f5c5c1aab1ae51][0m
[0m[1mmodule.was.data.aws_ami.ubuntu: Read complete after 1s [id=ami-037f5c5c1aab1ae51][0m
[0m[1mmodule.db.data.aws_secretsmanager_secret_version.db-secret: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:458197257493:secret:db-secret-6sXuZX|AWSCURRENT][0m
[0m[1mmodule.public_lb.data.aws_acm_certificate.amazon_issued: Read complete after 1s [id=arn:aws:acm:ap-northeast-2:458197257493:certificate/8d41f3f3-96de-4dd5-8f9a-e72e5e5ef013][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.db.aws_db_instance.postgres[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "postgres" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 10
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = (known after apply)
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = (known after apply)
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m db_name                               = "postgres"
      [32m+[0m[0m db_subnet_group_name                  = "joo-var.db-subnet-group"
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "postgres"
      [32m+[0m[0m engine_version                        = "15.3"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "joo"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = (known after apply)
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = true
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = (known after apply)
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = 5432
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = true
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Name"  = "joo-postgres"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Name"  = "joo-postgres"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (sensitive value)
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # module.db.aws_db_subnet_group.this[0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "this" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "joo-var.db-subnet-group"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = "joo-var.db-subnet-group"
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m subnet_ids              = (known after apply)
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Name"  = "joo-db-subnet-group"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Name"  = "joo-db-subnet-group"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1m  # module.db.aws_security_group.db[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "db" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "joo-db-sg"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = [
                  [32m+[0m[0m "::/0",
                ]
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Allow postgresql"
              [32m+[0m[0m from_port        = 5432
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 5432
            },
        ]
      [32m+[0m[0m name                   = "joo-db-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-db-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-db-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.iam.aws_iam_instance_profile.this[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "this" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "EC2InstanceProfileECR"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "ec2_role_ECR"
      [32m+[0m[0m tags        = {
          [32m+[0m[0m "Name"  = "joo-instance-profile-ecr"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Name"  = "joo-instance-profile-ecr"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.iam.aws_iam_policy.ecr_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "ecr_policy" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "ecr policy"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "ecr-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "ecr-public:GetAuthorizationToken",
                          [32m+[0m[0m "sts:GetServiceBearerToken",
                          [32m+[0m[0m "ecr-public:BatchCheckLayerAvailability",
                          [32m+[0m[0m "ecr-public:GetRepositoryPolicy",
                          [32m+[0m[0m "ecr-public:DescribeRepositories",
                          [32m+[0m[0m "ecr-public:DescribeRegistries",
                          [32m+[0m[0m "ecr-public:DescribeImages",
                          [32m+[0m[0m "ecr-public:DescribeImageTags",
                          [32m+[0m[0m "ecr-public:GetRepositoryCatalogData",
                          [32m+[0m[0m "ecr-public:GetRegistryCatalogData",
                          [32m+[0m[0m "ecr-public:InitiateLayerUpload",
                          [32m+[0m[0m "ecr-public:UploadLayerPart",
                          [32m+[0m[0m "ecr-public:CompleteLayerUpload",
                          [32m+[0m[0m "ecr-public:PutImage",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = (known after apply)
    }

[1m  # module.iam.aws_iam_role.ec2_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ec2_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = ""
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "ec2_role_ECR"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name"  = "joo-ec2-role"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Name"  = "joo-ec2-role"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.iam.aws_iam_role_policy_attachment.ec2_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ec2_role" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "ec2_role_ECR"
    }

[1m  # module.network.aws_eip.nat[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "nat" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-eip"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-eip"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.network.aws_eip.nat[1][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "nat" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-eip"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-eip"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # module.network.aws_internet_gateway.this[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "this" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Name"  = "joo-igw"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Name"  = "joo-igw"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # module.network.aws_nat_gateway.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-nat-gateway"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-nat-gateway"
          [32m+[0m[0m "owner" = "joo"
        }
    }

[1m  # module.network.aws_nat_gateway.this[1][0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-nat-gateway"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-nat-gateway"
          [32m+[0m[0m "owner" = "joo"
        }
    }

[1m  # module.network.aws_route.public_internet_gateway[0m will be created
[0m  [32m+[0m[0m resource "aws_route" "public_internet_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m gateway_id             = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # module.network.aws_route.web_nat_gateway[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "web_nat_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m nat_gateway_id         = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # module.network.aws_route.web_nat_gateway[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "web_nat_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m nat_gateway_id         = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # module.network.aws_route_table.public[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-public-route-table"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-public-route-table"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.network.aws_route_table.web[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "web" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-private-route-table"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-private-route-table"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.network.aws_route_table.web[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "web" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-private-route-table"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-private-route-table"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.network.aws_route_table_association.db[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "db" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.db[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "db" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.was[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "was" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.was[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "was" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.web[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "web" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_route_table_association.web[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "web" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.network.aws_subnet.db[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "db" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.80.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-db-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-db-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.db[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "db" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.90.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-db-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-db-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.private_lb[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private_lb" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.40.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-private-lb-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-private-lb-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.private_lb[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private_lb" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.50.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-private-lb-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-private-lb-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.0.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-public-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-public-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.10.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-public-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-public-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.was[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "was" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.60.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-was-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-was-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.was[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "was" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.70.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-was-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-was-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.web[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "web" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.20.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-web-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2a-web-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_subnet.web[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "web" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "ap-northeast-2c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.30.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-web-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Name"  = "joo-ap-northeast-2c-web-subnet"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.network.aws_vpc.main[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "main" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name"  = "joo-vpc"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name"  = "joo-vpc"
          [32m+[0m[0m "owner" = "joo"
        }
    }

[1m  # module.private_lb.aws_lb.private[0m will be created
[0m  [32m+[0m[0m resource "aws_lb" "private" {
      [32m+[0m[0m arn                                         = (known after apply)
      [32m+[0m[0m arn_suffix                                  = (known after apply)
      [32m+[0m[0m desync_mitigation_mode                      = "defensive"
      [32m+[0m[0m dns_name                                    = (known after apply)
      [32m+[0m[0m drop_invalid_header_fields                  = false
      [32m+[0m[0m enable_deletion_protection                  = false
      [32m+[0m[0m enable_http2                                = true
      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers = false
      [32m+[0m[0m enable_waf_fail_open                        = false
      [32m+[0m[0m enable_xff_client_port                      = false
      [32m+[0m[0m id                                          = (known after apply)
      [32m+[0m[0m idle_timeout                                = 60
      [32m+[0m[0m internal                                    = true
      [32m+[0m[0m ip_address_type                             = (known after apply)
      [32m+[0m[0m load_balancer_type                          = "application"
      [32m+[0m[0m name                                        = "joo-private-lb"
      [32m+[0m[0m name_prefix                                 = (known after apply)
      [32m+[0m[0m preserve_host_header                        = false
      [32m+[0m[0m security_groups                             = (known after apply)
      [32m+[0m[0m subnets                                     = (known after apply)
      [32m+[0m[0m tags                                        = {
          [32m+[0m[0m "Name"  = "joo-private-lb"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                    = {
          [32m+[0m[0m "Name"  = "joo-private-lb"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                      = (known after apply)
      [32m+[0m[0m xff_header_processing_mode                  = "append"
      [32m+[0m[0m zone_id                                     = (known after apply)
    }

[1m  # module.private_lb.aws_lb_listener.app[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "app" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name"  = "joo-private-lb-Listener"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name"  = "joo-private-lb-Listener"
          [32m+[0m[0m "owner" = "joo"
        }

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }
    }

[1m  # module.private_lb.aws_lb_target_group.was[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_target_group" "was" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = (known after apply)
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = "was-TG"
      [32m+[0m[0m name_prefix                        = (known after apply)
      [32m+[0m[0m port                               = 8000
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name"  = "joo-was-TG"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name"  = "joo-was-TG"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m target_type                        = "instance"
      [32m+[0m[0m vpc_id                             = (known after apply)
    }

[1m  # module.private_lb.aws_security_group.private_lb[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "private_lb" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "joo-private-lb-sg"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = [
                  [32m+[0m[0m "::/0",
                ]
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Allow app"
              [32m+[0m[0m from_port        = 80
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 80
            },
        ]
      [32m+[0m[0m name                   = "joo-private-lb-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-private-lb-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-private-lb-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.public_lb.aws_lb.public[0m will be created
[0m  [32m+[0m[0m resource "aws_lb" "public" {
      [32m+[0m[0m arn                                         = (known after apply)
      [32m+[0m[0m arn_suffix                                  = (known after apply)
      [32m+[0m[0m desync_mitigation_mode                      = "defensive"
      [32m+[0m[0m dns_name                                    = (known after apply)
      [32m+[0m[0m drop_invalid_header_fields                  = false
      [32m+[0m[0m enable_deletion_protection                  = false
      [32m+[0m[0m enable_http2                                = true
      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers = false
      [32m+[0m[0m enable_waf_fail_open                        = false
      [32m+[0m[0m enable_xff_client_port                      = false
      [32m+[0m[0m id                                          = (known after apply)
      [32m+[0m[0m idle_timeout                                = 60
      [32m+[0m[0m internal                                    = (known after apply)
      [32m+[0m[0m ip_address_type                             = (known after apply)
      [32m+[0m[0m load_balancer_type                          = "application"
      [32m+[0m[0m name                                        = "joo-public-lb"
      [32m+[0m[0m name_prefix                                 = (known after apply)
      [32m+[0m[0m preserve_host_header                        = false
      [32m+[0m[0m security_groups                             = (known after apply)
      [32m+[0m[0m subnets                                     = (known after apply)
      [32m+[0m[0m tags                                        = {
          [32m+[0m[0m "Name"  = "joo-public-lb"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                                    = {
          [32m+[0m[0m "Name"  = "joo-public-lb"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                                      = (known after apply)
      [32m+[0m[0m xff_header_processing_mode                  = "append"
      [32m+[0m[0m zone_id                                     = (known after apply)
    }

[1m  # module.public_lb.aws_lb_listener.http[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "http" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name"  = "joo-public-lb-http-Listener"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name"  = "joo-public-lb-http-Listener"
          [32m+[0m[0m "owner" = "joo"
        }

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }
      [32m+[0m[0m default_action {
          [32m+[0m[0m order = (known after apply)
          [32m+[0m[0m type  = "redirect"

          [32m+[0m[0m redirect {
              [32m+[0m[0m host        = "#{host}"
              [32m+[0m[0m path        = "/#{path}"
              [32m+[0m[0m port        = "443"
              [32m+[0m[0m protocol    = "HTTPS"
              [32m+[0m[0m query       = "#{query}"
              [32m+[0m[0m status_code = "HTTP_301"
            }
        }
    }

[1m  # module.public_lb.aws_lb_listener.https[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "https" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m certificate_arn   = "arn:aws:acm:ap-northeast-2:458197257493:certificate/8d41f3f3-96de-4dd5-8f9a-e72e5e5ef013"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 443
      [32m+[0m[0m protocol          = "HTTPS"
      [32m+[0m[0m ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name"  = "joo-public-lb-https-Listener"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name"  = "joo-public-lb-https-Listener"
          [32m+[0m[0m "owner" = "joo"
        }

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }
    }

[1m  # module.public_lb.aws_lb_target_group.web[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_target_group" "web" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = (known after apply)
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = "web-TG"
      [32m+[0m[0m name_prefix                        = (known after apply)
      [32m+[0m[0m port                               = 80
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name"  = "joo-web-TG"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Name"  = "joo-web-TG"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m target_type                        = "instance"
      [32m+[0m[0m vpc_id                             = (known after apply)
    }

[1m  # module.public_lb.aws_security_group.public_lb[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "public_lb" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "joo-public-lb-sg"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = [
                  [32m+[0m[0m "::/0",
                ]
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Allow https"
              [32m+[0m[0m from_port        = 443
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 443
            },
        ]
      [32m+[0m[0m name                   = "joo-public-lb-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-public-lb-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-public-lb-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.route53.aws_route53_record.private_lb[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "private_lb" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = true
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = "ZWKZPGTI48KDX"
        }
    }

[1m  # module.route53.aws_route53_record.public_lb[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "public_lb" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "app"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z05489631OD6CTLXAVCWK"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = true
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = "ZWKZPGTI48KDX"
        }
    }

[1m  # module.route53.aws_route53_zone.private[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_zone" "private" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m comment             = "Private DNS for Private LB"
      [32m+[0m[0m force_destroy       = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "joo.com"
      [32m+[0m[0m name_servers        = (known after apply)
      [32m+[0m[0m primary_name_server = (known after apply)
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "Name"  = "joo-private-zone"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all            = {
          [32m+[0m[0m "Name"  = "joo-private-zone"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m zone_id             = (known after apply)

      [32m+[0m[0m vpc {
          [32m+[0m[0m vpc_id     = (known after apply)
          [32m+[0m[0m vpc_region = (known after apply)
        }
    }

[1m  # module.was.aws_autoscaling_group.was[0m will be created
[0m  [32m+[0m[0m resource "aws_autoscaling_group" "was" {
      [32m+[0m[0m arn                              = (known after apply)
      [32m+[0m[0m availability_zones               = (known after apply)
      [32m+[0m[0m default_cooldown                 = (known after apply)
      [32m+[0m[0m desired_capacity                 = 2
      [32m+[0m[0m force_delete                     = false
      [32m+[0m[0m force_delete_warm_pool           = false
      [32m+[0m[0m health_check_grace_period        = 300
      [32m+[0m[0m health_check_type                = "EC2"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m ignore_failed_scaling_activities = false
      [32m+[0m[0m load_balancers                   = (known after apply)
      [32m+[0m[0m max_size                         = 4
      [32m+[0m[0m metrics_granularity              = "1Minute"
      [32m+[0m[0m min_size                         = 2
      [32m+[0m[0m name                             = "joo-was-asg"
      [32m+[0m[0m name_prefix                      = (known after apply)
      [32m+[0m[0m predicted_capacity               = (known after apply)
      [32m+[0m[0m protect_from_scale_in            = false
      [32m+[0m[0m service_linked_role_arn          = (known after apply)
      [32m+[0m[0m target_group_arns                = (known after apply)
      [32m+[0m[0m vpc_zone_identifier              = (known after apply)
      [32m+[0m[0m wait_for_capacity_timeout        = "5m"
      [32m+[0m[0m warm_pool_size                   = (known after apply)

      [32m+[0m[0m launch_template {
          [32m+[0m[0m id   = (known after apply)
          [32m+[0m[0m name = (known after apply)
        }

      [32m+[0m[0m tag {
          [32m+[0m[0m key                 = "Name"
          [32m+[0m[0m propagate_at_launch = true
          [32m+[0m[0m value               = "joo-was"
        }
      [32m+[0m[0m tag {
          [32m+[0m[0m key                 = "owner"
          [32m+[0m[0m propagate_at_launch = true
          [32m+[0m[0m value               = "joo"
        }
    }

[1m  # module.was.aws_launch_template.was[0m will be created
[0m  [32m+[0m[0m resource "aws_launch_template" "was" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_version        = (known after apply)
      [32m+[0m[0m description            = "joo-was-launch-template"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m image_id               = "ami-037f5c5c1aab1ae51"
      [32m+[0m[0m instance_type          = "t3.micro"
      [32m+[0m[0m key_name               = "juiceb"
      [32m+[0m[0m latest_version         = (known after apply)
      [32m+[0m[0m name                   = "joo-was-launch-template"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-was-launch-template"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-was-launch-template"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m user_data              = "IyEvYmluL2Jhc2gKCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLUlOU1RBTEwtRG9ja2VyLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0LWdldCB1cGRhdGUKc3VkbyBhcHQtZ2V0IGluc3RhbGwgY2EtY2VydGlmaWNhdGVzIGN1cmwgZ251cGcgLXkKc3VkbyBpbnN0YWxsIC1tIDA3NTUgLWQgL2V0Yy9hcHQva2V5cmluZ3MKY3VybCAtZnNTTCBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1L2dwZyB8IHN1ZG8gZ3BnIC0tZGVhcm1vciAtbyAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCnN1ZG8gY2htb2QgYStyIC9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGcKZWNobyBcCiAgImRlYiBbYXJjaD0iJChkcGtnIC0tcHJpbnQtYXJjaGl0ZWN0dXJlKSIgc2lnbmVkLWJ5PS9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGddIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgXAogICIkKC4gL2V0Yy9vcy1yZWxlYXNlICYmIGVjaG8gIiRWRVJTSU9OX0NPREVOQU1FIikiIHN0YWJsZSIgfCBcCiAgc3VkbyB0ZWUgL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvZG9ja2VyLmxpc3QgPiAvZGV2L251bGwKc3VkbyBhcHQtZ2V0IHVwZGF0ZQpzdWRvIGFwdC1nZXQgaW5zdGFsbCBkb2NrZXItY2UgZG9ja2VyLWNlLWNsaSBjb250YWluZXJkLmlvIGRvY2tlci1idWlsZHgtcGx1Z2luIGRvY2tlci1jb21wb3NlLXBsdWdpbiAteQoKZWNobyAiLi4uLi4uLi4uLS0tLS0tLS0tLS0tLS0tLSMjIyMjIyMjIyMjIyMjIyMjLl8uLS4tSU5TVEFMTC1BV1MtQ0xJLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0IGluc3RhbGwgdW56aXAgLXkKY3VybCAiaHR0cHM6Ly9hd3NjbGkuYW1hem9uYXdzLmNvbS9hd3NjbGktZXhlLWxpbnV4LXg4Nl82NC56aXAiIC1vICJhd3NjbGl2Mi56aXAiCnN1ZG8gdW56aXAgYXdzY2xpdjIuemlwCnN1ZG8gLi9hd3MvaW5zdGFsbCAtaSAvdXNyL2xvY2FsL2F3cy1jbGkgLWIgL3Vzci9sb2NhbC9iaW4KCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLURFUExPWS1DT05UQUlORVIuLS5fLiMjIyMjIyMjIyMjIyMjIyMjLS0tLS0tLS0tLS0tLS0tLS4uLi4uLi4uLiIKYXdzIGVjci1wdWJsaWMgZ2V0LWxvZ2luLXBhc3N3b3JkIC0tcmVnaW9uIHVzLWVhc3QtMSB8IHN1ZG8gZG9ja2VyIGxvZ2luIC0tdXNlcm5hbWUgQVdTIC0tcGFzc3dvcmQtc3RkaW4gcHVibGljLmVjci5hd3MvaDV2OGs1eTgKc3VkbyBkb2NrZXIgcnVuIC1kIC1wIDgwMDA6ODAwMCAtLW5hbWUgYXBwIHB1YmxpYy5lY3IuYXdzL2g1djhrNXk4L2FwcDowLjE="
      [32m+[0m[0m vpc_security_group_ids = (known after apply)

      [32m+[0m[0m iam_instance_profile {
          [32m+[0m[0m arn = (known after apply)
        }
    }

[1m  # module.was.aws_security_group.was[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "was" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "joo-was-sg"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = [
                  [32m+[0m[0m "::/0",
                ]
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Allow app"
              [32m+[0m[0m from_port        = 8000
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 8000
            },
        ]
      [32m+[0m[0m name                   = "joo-was-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-was-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-was-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.web.aws_autoscaling_group.web[0m will be created
[0m  [32m+[0m[0m resource "aws_autoscaling_group" "web" {
      [32m+[0m[0m arn                              = (known after apply)
      [32m+[0m[0m availability_zones               = (known after apply)
      [32m+[0m[0m default_cooldown                 = (known after apply)
      [32m+[0m[0m desired_capacity                 = 2
      [32m+[0m[0m force_delete                     = false
      [32m+[0m[0m force_delete_warm_pool           = false
      [32m+[0m[0m health_check_grace_period        = 300
      [32m+[0m[0m health_check_type                = "EC2"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m ignore_failed_scaling_activities = false
      [32m+[0m[0m load_balancers                   = (known after apply)
      [32m+[0m[0m max_size                         = 4
      [32m+[0m[0m metrics_granularity              = "1Minute"
      [32m+[0m[0m min_size                         = 2
      [32m+[0m[0m name                             = "joo-web-asg"
      [32m+[0m[0m name_prefix                      = (known after apply)
      [32m+[0m[0m predicted_capacity               = (known after apply)
      [32m+[0m[0m protect_from_scale_in            = false
      [32m+[0m[0m service_linked_role_arn          = (known after apply)
      [32m+[0m[0m target_group_arns                = (known after apply)
      [32m+[0m[0m vpc_zone_identifier              = (known after apply)
      [32m+[0m[0m wait_for_capacity_timeout        = "5m"
      [32m+[0m[0m warm_pool_size                   = (known after apply)

      [32m+[0m[0m launch_template {
          [32m+[0m[0m id   = (known after apply)
          [32m+[0m[0m name = (known after apply)
        }

      [32m+[0m[0m tag {
          [32m+[0m[0m key                 = "Name"
          [32m+[0m[0m propagate_at_launch = true
          [32m+[0m[0m value               = "joo-web"
        }
      [32m+[0m[0m tag {
          [32m+[0m[0m key                 = "owner"
          [32m+[0m[0m propagate_at_launch = true
          [32m+[0m[0m value               = "joo"
        }
    }

[1m  # module.web.aws_launch_template.web[0m will be created
[0m  [32m+[0m[0m resource "aws_launch_template" "web" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_version        = (known after apply)
      [32m+[0m[0m description            = "joo-web-launch-template"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m image_id               = "ami-037f5c5c1aab1ae51"
      [32m+[0m[0m instance_type          = "t3.micro"
      [32m+[0m[0m key_name               = "juiceb"
      [32m+[0m[0m latest_version         = (known after apply)
      [32m+[0m[0m name                   = "joo-web-launch-template"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-web-launch-template"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-web-launch-template"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m user_data              = "IyEvYmluL2Jhc2gKCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLUlOU1RBTEwtRG9ja2VyLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0LWdldCB1cGRhdGUKc3VkbyBhcHQtZ2V0IGluc3RhbGwgY2EtY2VydGlmaWNhdGVzIGN1cmwgZ251cGcgLXkKc3VkbyBpbnN0YWxsIC1tIDA3NTUgLWQgL2V0Yy9hcHQva2V5cmluZ3MKY3VybCAtZnNTTCBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1L2dwZyB8IHN1ZG8gZ3BnIC0tZGVhcm1vciAtbyAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCnN1ZG8gY2htb2QgYStyIC9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGcKZWNobyBcCiAgImRlYiBbYXJjaD0iJChkcGtnIC0tcHJpbnQtYXJjaGl0ZWN0dXJlKSIgc2lnbmVkLWJ5PS9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGddIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgXAogICIkKC4gL2V0Yy9vcy1yZWxlYXNlICYmIGVjaG8gIiRWRVJTSU9OX0NPREVOQU1FIikiIHN0YWJsZSIgfCBcCiAgc3VkbyB0ZWUgL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvZG9ja2VyLmxpc3QgPiAvZGV2L251bGwKc3VkbyBhcHQtZ2V0IHVwZGF0ZQpzdWRvIGFwdC1nZXQgaW5zdGFsbCBkb2NrZXItY2UgZG9ja2VyLWNlLWNsaSBjb250YWluZXJkLmlvIGRvY2tlci1idWlsZHgtcGx1Z2luIGRvY2tlci1jb21wb3NlLXBsdWdpbiAteQoKZWNobyAiLi4uLi4uLi4uLS0tLS0tLS0tLS0tLS0tLSMjIyMjIyMjIyMjIyMjIyMjLl8uLS4tSU5TVEFMTC1BV1MtQ0xJLi0uXy4jIyMjIyMjIyMjIyMjIyMjIy0tLS0tLS0tLS0tLS0tLS0uLi4uLi4uLi4iCnN1ZG8gYXB0IGluc3RhbGwgdW56aXAgLXkKY3VybCAiaHR0cHM6Ly9hd3NjbGkuYW1hem9uYXdzLmNvbS9hd3NjbGktZXhlLWxpbnV4LXg4Nl82NC56aXAiIC1vICJhd3NjbGl2Mi56aXAiCnN1ZG8gdW56aXAgYXdzY2xpdjIuemlwCnN1ZG8gLi9hd3MvaW5zdGFsbCAtaSAvdXNyL2xvY2FsL2F3cy1jbGkgLWIgL3Vzci9sb2NhbC9iaW4KCmVjaG8gIi4uLi4uLi4uLi0tLS0tLS0tLS0tLS0tLS0jIyMjIyMjIyMjIyMjIyMjIy5fLi0uLURFUExPWS1DT05UQUlORVIuLS5fLiMjIyMjIyMjIyMjIyMjIyMjLS0tLS0tLS0tLS0tLS0tLS4uLi4uLi4uLiIKYXdzIGVjci1wdWJsaWMgZ2V0LWxvZ2luLXBhc3N3b3JkIC0tcmVnaW9uIHVzLWVhc3QtMSB8IHN1ZG8gZG9ja2VyIGxvZ2luIC0tdXNlcm5hbWUgQVdTIC0tcGFzc3dvcmQtc3RkaW4gcHVibGljLmVjci5hd3MvaDV2OGs1eTgKc3VkbyBkb2NrZXIgcnVuIC1kIC1wIDgwOjgwIC0tbmFtZSBuZ2lueCBwdWJsaWMuZWNyLmF3cy9oNXY4azV5OC9uZ2lueDowLjE="
      [32m+[0m[0m vpc_security_group_ids = (known after apply)

      [32m+[0m[0m iam_instance_profile {
          [32m+[0m[0m arn = (known after apply)
        }
    }

[1m  # module.web.aws_security_group.web[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "web" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "joo-web-sg"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = [
                  [32m+[0m[0m "::/0",
                ]
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Allow http"
              [32m+[0m[0m from_port        = 80
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 80
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Allow https"
              [32m+[0m[0m from_port        = 443
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 443
            },
        ]
      [32m+[0m[0m name                   = "joo-web-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"  = "joo-web-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name"  = "joo-web-sg"
          [32m+[0m[0m "owner" = "joo"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1mPlan:[0m 55 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m db_instance_hosted_zone_id = (known after apply)
  [32m+[0m[0m lb_sg_id                   = (known after apply)
  [32m+[0m[0m vpc_id                     = (known after apply)
  [32m+[0m[0m vpc_zone_identifier        = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m was_sg_id                  = (known after apply)
  [32m+[0m[0m web_sg_id                  = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

 ```

 </details>

 **위의 내용으로 테라폼 배포를 요청합니다!**

 *Pusher: @juiceb7597, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS Workflow`*